DS Data base SQl class-12

In [1]:
import sqlite3

In [2]:
db=sqlite3.connect('my_studentdatabse2.db')

In [3]:
cur=db.cursor()

In [4]:
results=cur.execute("select * from student")

for i in results:
    print(i)

(1, 'Andrew', 20)
(2, 'Smith', 19)
(3, 'John', 22)
(4, 'Jack', 19)
(5, 'Lisa', 24)
(6, 'Brain', 22)
(7, 'William', 24)

In [5]:
results=cur.execute("select id from student")

for i in results:
    print(i)

(1,)
(2,)
(3,)
(4,)
(5,)
(6,)
(7,)

In [6]:
cur.execute("insert into student values (8,'Kira',29),(9,'David',22)")

db.commit()
print(cur.rowcount,"record(s) inserted")

2 record(s) inserted

In [8]:
results=cur.execute("select * from student")

results.fetchall()

[(1, 'Andrew', 20),
 (2, 'Smith', 19),
 (3, 'John', 22),
 (4, 'Jack', 19),
 (5, 'Lisa', 24),
 (6, 'Brain', 22),
 (7, 'William', 24),
 (8, 'Kira', 29),
 (9, 'David', 22)]

In [12]:
results=cur.execute("select * from student")

results.fetchall()

[(1, 'Andrew', 20),
 (2, 'Smith', 19),
 (3, 'John', 22),
 (4, 'Jack', 19),
 (5, 'Lisa', 24),
 (6, 'Brain', 22),
 (7, 'William', 24),
 (8, 'Kira', 29),
 (9, 'David', 22)]

In [13]:
results=cur.execute("select * from student where id=2")

results.fetchall()

[(2, 'Smith', 19)]

In [14]:
results=cur.execute("select * from student where id=2")

results.fetchone()

(2, 'Smith', 19)

In [15]:
results=cur.execute("select * from student where id=6")

results.fetchone()

(6, 'Brain', 22)

In [16]:
results=cur.execute("select * from student where age < 25")

results.fetchall()

[(1, 'Andrew', 20),
 (2, 'Smith', 19),
 (3, 'John', 22),
 (4, 'Jack', 19),
 (5, 'Lisa', 24),
 (6, 'Brain', 22),
 (7, 'William', 24),
 (9, 'David', 22)]

# in operator

In [17]:
results=cur.execute("select * from student where id in (5,6,3)")

for i in results:
    print(i)

(3, 'John', 22)
(5, 'Lisa', 24)
(6, 'Brain', 22)

In [18]:
results=cur.execute("select * from student where age=24")

for i in results:
    print(i)

(5, 'Lisa', 24)
(7, 'William', 24)

insted age you will use marks

In [19]:
results=cur.execute("select * from student where age in (19,20,24)")

for i in results:
    print(i)

(1, 'Andrew', 20)
(2, 'Smith', 19)
(4, 'Jack', 19)
(5, 'Lisa', 24)
(7, 'William', 24)

NOT operator

In [20]:
results=cur.execute("select * from student where id NOT (4,5)")

for i in results:
    print(i)

OperationalError: near "(": syntax error

In [21]:
results=cur.execute("select * from student where id NOT in (4,5)")

for i in results:
    print(i)

(1, 'Andrew', 20)
(2, 'Smith', 19)
(3, 'John', 22)
(6, 'Brain', 22)
(7, 'William', 24)
(8, 'Kira', 29)
(9, 'David', 22)

In [22]:
results=cur.execute("select * from student where id in (1,2,3)")

for i in results:
    print(i)

(1, 'Andrew', 20)
(2, 'Smith', 19)
(3, 'John', 22)

In [23]:
results=cur.execute("select * from student where id NOT in (1,2,3)")

for i in results:
    print(i)

(4, 'Jack', 19)
(5, 'Lisa', 24)
(6, 'Brain', 22)
(7, 'William', 24)
(8, 'Kira', 29)
(9, 'David', 22)

and operator

In [24]:
results=cur.execute("select * from student where age>19 and age<25")

for i in results:
    print(i)

(1, 'Andrew', 20)
(3, 'John', 22)
(5, 'Lisa', 24)
(6, 'Brain', 22)
(7, 'William', 24)
(9, 'David', 22)

In [25]:
results=cur.execute("select * from student where age>25 and age<29")

for i in results:
    print(i)

In [26]:
results=cur.execute("select * from student where age>25 and age<30")

for i in results:
    print(i)

(8, 'Kira', 29)

In [27]:
results=cur.execute("select * from student where age>=25 and age<=29")

for i in results:
    print(i)

(8, 'Kira', 29)

In [34]:
results=cur.execute("select * from student where id=1 and name='Andrew'")

for i in results:
    print(i)

(1, 'Andrew', 20)

In [35]:
results=cur.execute("select * from student where age<25 and id(1,2,3)")

for i in results:
    print(i)

OperationalError: no such function: id

In [36]:
results=cur.execute("select * from student where age<24 and id(5,6,7)")

for i in results:
    print(i)

OperationalError: no such function: id

In [37]:
results=cur.execute("select * from student where age<24 and id in(5,6,7)")

for i in results:
    print(i)

(6, 'Brain', 22)

or operator

In [28]:
results=cur.execute("select * from student where age>19 or age<25")

for i in results:
    print(i)

(1, 'Andrew', 20)
(2, 'Smith', 19)
(3, 'John', 22)
(4, 'Jack', 19)
(5, 'Lisa', 24)
(6, 'Brain', 22)
(7, 'William', 24)
(8, 'Kira', 29)
(9, 'David', 22)

In [29]:
results=cur.execute("select * from student where age=19 or age=25")

for i in results:
    print(i)

(2, 'Smith', 19)
(4, 'Jack', 19)

In [30]:
results=cur.execute("select * from student where age=19 or age=29")

for i in results:
    print(i)

(2, 'Smith', 19)
(4, 'Jack', 19)
(8, 'Kira', 29)

In [31]:
results=cur.execute("select * from student where age>=19 or age<=29")

for i in results:
    print(i)

(1, 'Andrew', 20)
(2, 'Smith', 19)
(3, 'John', 22)
(4, 'Jack', 19)
(5, 'Lisa', 24)
(6, 'Brain', 22)
(7, 'William', 24)
(8, 'Kira', 29)
(9, 'David', 22)

In [32]:
results=cur.execute("select * from student where age=24 or id=8")

for i in results:
    print(i)

(5, 'Lisa', 24)
(7, 'William', 24)
(8, 'Kira', 29)

In [33]:
results=cur.execute("select * from student where age=19 or id=6")

for i in results:
    print(i)

(2, 'Smith', 19)
(4, 'Jack', 19)
(6, 'Brain', 22)

In [38]:
results=cur.execute("select * from student")

for i in results:
    print(i)

(1, 'Andrew', 20)
(2, 'Smith', 19)
(3, 'John', 22)
(4, 'Jack', 19)
(5, 'Lisa', 24)
(6, 'Brain', 22)
(7, 'William', 24)
(8, 'Kira', 29)
(9, 'David', 22)

asending order and desdending oder

In [39]:
results=cur.execute("select * from student order by name asc")

for i in results:
    print(i)

(1, 'Andrew', 20)
(6, 'Brain', 22)
(9, 'David', 22)
(4, 'Jack', 19)
(3, 'John', 22)
(8, 'Kira', 29)
(5, 'Lisa', 24)
(2, 'Smith', 19)
(7, 'William', 24)

In [40]:
results=cur.execute("select * from student order by name desc")

for i in results:
    print(i)

(7, 'William', 24)
(2, 'Smith', 19)
(5, 'Lisa', 24)
(8, 'Kira', 29)
(3, 'John', 22)
(4, 'Jack', 19)
(9, 'David', 22)
(6, 'Brain', 22)
(1, 'Andrew', 20)

In [41]:
results=cur.execute("select * from student order by age desc")

for i in results:
    print(i)

(8, 'Kira', 29)
(5, 'Lisa', 24)
(7, 'William', 24)
(3, 'John', 22)
(6, 'Brain', 22)
(9, 'David', 22)
(1, 'Andrew', 20)
(2, 'Smith', 19)
(4, 'Jack', 19)

Beter to use for loop beter you can eliminate data easily (for i in results:)
                                                               print(i)              insted fechall

In [42]:
results=cur.execute("select age from student")

for i in results:
    print(i)

(20,)
(19,)
(22,)
(19,)
(24,)
(22,)
(24,)
(29,)
(22,)

In [43]:
results=cur.execute("select mim(age) from student")

for i in results:
    print(i)

OperationalError: no such function: mim

In [44]:
results=cur.execute("select min(age) from student")

for i in results:
    print(i)

(19,)

In [45]:
results=cur.execute("select max(age) from student")

for i in results:
    print(i)

(29,)

insted age create student table with marks you will use marks insted age

In [46]:
results=cur.execute("select avg(age) from student")

for i in results:
    print(i)

(22.333333333333332,)

In [47]:
results=cur.execute("select sum(age) from student")

for i in results:
    print(i)

(201,)

In [48]:
results=cur.execute("select count(id) from student")

for i in results:
    print(i)

(9,)

between operator

In [49]:
results=cur.execute("select * from student where between 20 and 29")

for i in results:
    print(i)

OperationalError: near "between": syntax error

In [50]:
results=cur.execute("select * from student where age between 20 and 29")

for i in results:
    print(i)

(1, 'Andrew', 20)
(3, 'John', 22)
(5, 'Lisa', 24)
(6, 'Brain', 22)
(7, 'William', 24)
(8, 'Kira', 29)
(9, 'David', 22)

null operator

In [51]:
results=cur.execute("select * from student")

for i in results:
    print(i)

(1, 'Andrew', 20)
(2, 'Smith', 19)
(3, 'John', 22)
(4, 'Jack', 19)
(5, 'Lisa', 24)
(6, 'Brain', 22)
(7, 'William', 24)
(8, 'Kira', 29)
(9, 'David', 22)

In [52]:
results=cur.execute("select * from student where age is null")

for i in results:
    print(i)

there is no null data in 52 input operation

In [53]:
results=cur.execute("select * from student where age is NOT null")

for i in results:
    print(i)

(1, 'Andrew', 20)
(2, 'Smith', 19)
(3, 'John', 22)
(4, 'Jack', 19)
(5, 'Lisa', 24)
(6, 'Brain', 22)
(7, 'William', 24)
(8, 'Kira', 29)
(9, 'David', 22)

LIKE operator

%-any charactor   _-single charactor

In [54]:
results=cur.execute("select * from student")

for i in results:
    print(i)

(1, 'Andrew', 20)
(2, 'Smith', 19)
(3, 'John', 22)
(4, 'Jack', 19)
(5, 'Lisa', 24)
(6, 'Brain', 22)
(7, 'William', 24)
(8, 'Kira', 29)
(9, 'David', 22)

In [55]:
results=cur.execute("select * from student where name LIKE '%a%'")

for i in results:
    print(i)

(1, 'Andrew', 20)
(4, 'Jack', 19)
(5, 'Lisa', 24)
(6, 'Brain', 22)
(7, 'William', 24)
(8, 'Kira', 29)
(9, 'David', 22)

In [56]:
results=cur.execute("select * from student where name LIKE 'A%'")

for i in results:
    print(i)

(1, 'Andrew', 20)

In [57]:
results=cur.execute("select * from student where name LIKE '%w'")

for i in results:
    print(i)

(1, 'Andrew', 20)

In [58]:
results=cur.execute("select * from student where name LIKE '_a__'")

for i in results:
    print(i)

(4, 'Jack', 19)

In [59]:
results=cur.execute("select * from student where name LIKE '_ll%'")

for i in results:
    print(i)

In [60]:
results=cur.execute("select * from student where name LIKE '__ll%'")

for i in results:
    print(i)

(7, 'William', 24)

In [61]:
results=cur.execute("select * from student where name LIKE '%i%'")

for i in results:
    print(i)

(2, 'Smith', 19)
(5, 'Lisa', 24)
(6, 'Brain', 22)
(7, 'William', 24)
(8, 'Kira', 29)
(9, 'David', 22)

In [62]:
results=cur.execute("select * from student where name LIKE 'd%'")

for i in results:
    print(i)

(9, 'David', 22)

In [63]:
results=cur.execute("select * from student where name LIKE 'K%a'")

for i in results:
    print(i)

(8, 'Kira', 29)

In [64]:
results=cur.execute("select * from student where name LIKE '_____'")

for i in results:
    print(i)

(2, 'Smith', 19)
(6, 'Brain', 22)
(9, 'David', 22)

Alt+Ent- Use additional cell/add cell & Ctrl+Entre - for Run the command